"use strict";
(function(){
  var prodata={
  	//奶油蛋糕
	    item:[
				{'name':'奶油裱花花嘴练习','img':'procake-img3.jpg'},
				{'name':'抹面练习展示','img':'procake-img4.jpg'},
				{'name':'蛋糕造型展示','img':'procake-img5.jpg'},
				{'name':'创意蛋糕展示','img':'procake-img6.jpg'}
			],
		//韩式裱花
			item2:[
				{'name':'韩式裱花花卉制作','img':'procake-img33.jpg'},
				{'name':'3D浮雕造型展示','img':'procake-img34.jpg'},
				{'name':'杯子蛋糕展示','img':'procake-img35.jpg'},
				{'name':'整体造型展示','img':'procake-img36.jpg'}
			],
		//面包烘焙
			item3:[
				{'name':'餐包成品展示','img':'procake-img51.jpg'},
				{'name':'软欧成品展示','img':'procake-img52.jpg'},
				{'name':'吐司三明治展示','img':'procake-img53.jpg'},
				{'name':'起酥面包展示','img':'procake-img54.jpg'}
			],
			//咖啡拉花
			item4:[
				{'name':'咖啡拉花展示','img':'procake-img71.jpg'}
			],
			//慕斯课程
			item5:[
				{'name':'慕斯蛋糕系列','text':['1.制作与加工工艺：芒果百香果慕斯等；','2.温度时间掌控：烘烤时间以及打发程度等。'],'img':'procake-img77.jpg'},
				{'name':'巧克力系列','text':['1.制作与加工工艺：夜空巧克力慕斯、','掌控巧克力融化温度、以及搅拌过程的手法','......','2.装饰技巧：慕斯蛋糕的装饰','......'
  ],'img':'procake-img78.jpg'},
				{'name':'淋面蛋糕','text':['淋面制作与要领：芒果淋面、巧克力镜面淋面','淋面制作程序及加热温度和整体装饰','......'],'img':'procake-img79.jpg'},
				{'name':'经典法式','text':['1.摆盘与装饰：提拉米苏、手指饼干、','咖啡水的制作及作用','......','2.制作与加工工艺：黑森林','......'],'img':'procake-img80.jpg'},
				{'name':'饼干系列','text':['1.制作与加工工艺：网红曲奇、牛油小花、夹心饼干','......','2.注意事项：制作曲奇黄油的打发等','......'],'img':'procake-img81.jpg'},
				{'name':'蛋糕卷系列','text':['彩绘蛋糕卷，经典虎皮蛋糕卷：蛋白打发状态的判断、','面糊搅拌手法与技巧','......'],'img':'procake-img82.jpg'},
				{'name':'明星产品','text':['制作手法及注意事项：修女泡芙，香橙卡仕达酱、','柠檬卡仕达酱馅料制作','......'],'img':'procake-img83.jpg'},
				{'name':'创意慕斯','text':['制作手法及注意事项：苦瓜慕斯，网红小沙皮、','制作慕斯酱注意事项及手法','......'],'img':'procake-img84.jpg'},
				{'name':'杯子系列','text':['制作与加工工艺：椰浆豆腐、法式茶香布丁、','整体装饰及制作','......'],'img':'procake-img88.jpg'},
				{'name':'马卡龙','text':['马卡龙制作：马卡龙、','奶油霜夹馅（或巧克力夹馅）','......'],'img':'procake-img85.jpg'},
				{'name':'微商特色产品','text':['1.千层蛋糕、毛巾卷','2.凤梨香酥','3.彩色流心蛋黄酥 ','......'],'img':'procake-img86.jpg'}
			],
			//港式甜品
			item6:[
				{'name':'甜品类展示','img':'procake-img98.jpg'},
				{'name':'手工甜品展示','img':'procake-img99.jpg'},
				{'name':'养生甜品类展示','img':'procake-img100.jpg'},
				{'name':'新品热销类展示','img':'procake-img101.jpg'}
			],
			//饮品课程
			item7:[
				{'name':'奶盖','text':['1.芝士奶盖、鲜奶奶盖、抹茶奶盖','2.各种奶盖的制作','3.各种奶盖的配比','4.各种奶盖的打发手法','5.各种奶盖的保存及设备操作'],'img':'procake-img110.jpg'},
				{'name':'半成品煮制','text':['1.珍珠、小芋圆、','2.黑糖珍珠、芋泥的制作方法','3.煮制的时间及煮制温度的掌控','4.保存及设备操作','......'],'img':'procake-img111.jpg'},
				{'name':'经典奶茶','text':['1.制作过程：烤奶、黑水晶奶茶、奶茶三兄弟、','鸳鸯奶茶、芋见泥珍好、奥利奥奶茶、布蕾奶茶','......','2.注意：制作过程中需要注意水温温度；制作饮品的手法；','饮品的配比调配与重量；成品的装饰','......'],'img':'procake-img112.jpg'},
				{'name':'气泡系列','text':['百香益力多苏打、红石榴苏打','青柠莫吉托、西瓜苏打','......'],'img':'procake-img113.jpg'},
				{'name':'手打芝士现萃原茶系列','text':['芝士四季青、芝士绿妍、芝士脆珠红玉、','芝士桂花乌龙、芝士樱花乌龙、芝士绿玫','......'],'img':'procake-img114.jpg'},
				{'name':'纯茶系列','text':['1.制作过程：茉莉满山开、一朵玫瑰花、','云沐桂花香、冻顶乌龙','......','2.注意：制作过程中需要注意水温温度;','操作时间的控制；制作饮品的手法;','饮品的配比调配与重量；成品的装饰;','......'],'img':'procake-img115.jpg'},
				{'name':'花果纯茶','text':['1.制作过程：香水柠檬、满杯清香红柚、满杯草莓','满杯凤梨、粒粒西柚绿茶','......','2.注意：操作过程中注意配比刻度的准确度；','水果茶的甜度掌控；制作过程的手法掌握；成品的装饰;','......'],'img':'procake-img116.jpg'},
				{'name':'特色甜品','text':['法式焦糖布蕾、樽装巧克力布蕾','......'],'img':'procake-img117.jpg'},
				{'name':'超级水果杯','text':['1.超级芒果杯、超级草莓杯','2.超级西瓜杯、超级蓝莓杯','......'],'img':'procake-img118.jpg'},
				{'name':'鲜果益力多','text':['制作过程：百香益力多、石榴益力多','......'],'img':'procake-img119.jpg'},
				{'name':'鲜奶茶','text':['1.皇家九号奶茶','2.小山绿鲜奶茶','3.红玉鲜奶茶 ','......'],'img':'procake-img120.jpg'},
				{'name':'冰沙','text':['1.云雾冰沙：芝士芒芒、芝士莓莓、仙蜜火龙、幽兰草莓','2.浮云冰沙：火龙果云、柚子云 ','......'],'img':'procake-img121.jpg'},
				{'name':'冲调暖饮系列','text':['桂圆红枣茶、暖胃生姜茶、柠檬柚子茶 ','......'],'img':'procake-img122.jpg'},
				{'name':'脏脏系列','text':['黑糖珍珠鲜牛乳、黑糖珍珠鲜奶红茶、','手作芋圆芋泥鲜奶 ','......'],'img':'procake-img123.jpg'}
			],
			//翻糖课程
			item8:[
				{'name':'花卉制作','text':['花卉制作：玫瑰花、牡丹、蝴蝶兰、奥斯汀玫瑰、','绣球花、波斯菊、栀子花、大丽花、毛茛','......'],'img':'procake-img186.jpg'},
				{'name':'多肉制作','text':[],'img':'procake-img187.jpg'},
				{'name':'花卉组装','text':[],'img':'procake-img188.jpg'},
				{'name':'蛋糕胚烤制','text':['1.翻糖蛋糕胚制作：磅蛋糕或海绵蛋糕','2.翻糖纸杯：海绵蛋糕制作','3.蛋糕胚的讲解、烤制、保存','4.纸杯的讲解和烤制','5.纸杯蛋糕的各种装饰','6.翻糖奶油霜','7.奶油霜的讲解和制作、使用、保存','......'],'img':'procake-img189.jpg'},
				{'name':'翻糖仿真人偶制作','text':[],'img':'procake-img190.jpg'},
				{'name':'翻糖卡通玩偶制作','text':[],'img':'procake-img191.jpg'},
				{'name':'翻糖、糖霜饼干','text':['翻糖、糖霜饼干是饼干中较为特殊的一种，','以其细腻的外表、独特的内容夺人眼球，','通过糖霜饼干我们可以发挥无穷的想象力，','在不同的场合做出各种主题：卡通、婚礼、节日等等。'],'img':'procake-img192.jpg'},
				{'name':'翻糖蛋糕及甜品台营销理论','text':['1.技法包含：多个甜品台案例分析成功甜品台的必要元素，','包括主题、配色、托盘搭配、层次、布局；','素材查找方式与积累。','2.技术特点：分享甜品台摆台配色经验、','新人及婚庆沟通技巧、甜品台食材及器皿购买渠道。'],'img':'procake-img193.jpg'}
			],
			//调酒课程
			item9:[
				{'name':'主要学习内容','text':['1.鸡尾酒的调制方法，配色装饰美化技巧和饮料调制的色彩组合','2.发酵酒知识、蒸馏酒知识鸡尾酒的基本结构鸡尾酒调制程序','3.调酒师的礼仪、仪表酒吧简述，工作程序酒水推销和','技巧......'],'img':'procake-img208.jpg'},
				{'name':'极具人气的八种标准鸡尾酒(上)','text':['华氏5度Fahrenheit5、修道院狂欢、夏日酸甜鸡尾酒、','阿佩罗开胃鸡尾酒、蜜月、26号鸡尾酒、','雾里看花 、鲜桃啤酒','......'],'img':'procake-img209.jpg'},
				{'name':'极具人气的八种标准鸡尾酒(下)','text':['幸福飘香鸡尾酒、金色梦幻鸡尾酒、海蓝、秋天的灰烬、','海军准将 、传送走廊、玫瑰莫吉托、蓝色海豚 ','......'],'img':'procake-img210.jpg'},
				{'name':'超酷经典鸡尾酒35款（一）','text':['月蚀鸡尾酒、天使之吻、金汤力、红粉佳人、蓝色夏威夷、龙舌兰日出、B-52、长岛冰茶、','黑俄罗斯、自由古巴、新加坡司令 、地震鸡尾酒  ','......'],'img':'procake-img211.jpg'},
				{'name':' 超酷鸡尾酒35款（二）','text':['蜜桃冰淇淋波本威士忌鸡尾酒、彩虹酒、亚历山大、','莫吉托、环游世界、蚱蜢、蓝色玛格丽特、','飞机头、咸狗、金酒戴丝、蓝色珊瑚礁、','阿佩罗龙舌兰调酒','    ......'],'img':'procake-img212.jpg'},
				{'name':' 超酷鸡尾酒35款（三）','text':['纽约鸡尾酒、教父、青草蜢、血腥玛丽、性感沙滩、','优雅大都会、 一杆进洞鸡尾酒 、经典马天尼、螺丝刀、','8号当铺、四海为家、龙舌兰夏湾娜   ','......'],'img':'procake-img213.jpg'},
			],
			//法式西点
			item10:[
				{'name':'歌剧院系列展示','img':'procake-img229.jpg'},
				{'name':'仿真水果展示','img':'procake-img230.jpg'},
				{'name':'精美法点展示','img':'procake-img231.jpg'},
				{'name':'手工巧克力展示','img':'procake-img232.jpg'}
			],
			//生日蛋糕
			item11:[
				{'name':'圆形蛋糕展示','img':'procake-img246.jpg'},
				{'name':'芭比蛋糕展示','img':'procake-img247.jpg'},
				{'name':'鲜花蛋糕展示','img':'procake-img248.jpg'},
				{'name':'创意蛋糕展示','img':'procake-img249.jpg'}
			],
			//西点全科
			item12:[
				{'name':'莫兰缇流行西点课程','tit':true,'text':['1.戚风蛋糕胚系列：香草美人胚、法芙娜巧克力胚等；','2.经典蛋糕款：德式黑森林、提拉米苏等；','3.饼干系列：蔓越莓饼干、牛油小花、手工雪花酥等；','4.Roll Cake系列：梦龙魔法蛋糕卷、经典虎皮蛋糕卷等；','5.明星产品：黑糖珍珠泡芙、日式半熟芝士','......'],'img':'procake-img250.jpg'},
				{'name':'莫兰缇私房蛋糕课程','tit':false,'text':['1.花嘴练习：多种立体花卉、平面花卉的裱花手法与技巧等；','2.抹面技巧练习：圆形蛋糕、方形蛋糕、心型蛋糕等；','3.蛋糕胚制作：戚风胚、巧克力胚等；','4.蛋糕制作练习 ：圆形蛋糕、水果裸蛋糕、芭比蛋糕','......'],'img':'procake-img250.jpg'},
				{'name':'莫兰缇烘焙面包课程','tit':true,'text':['1.甜面包：面团制作及造型装饰，手工饼干的制作等；','2.餐包的制作：红豆餐包、提子餐包、豆沙条等；','3.中种面包的讲解：翠华菠萝包、浪漫甜甜圈等；','4.胡萝卜面包的制作：胡萝卜面包面团的操作及装饰等；','5.欧包的制作：软欧的制作，硬欧的制作','......'],'img':'procake-img250.jpg'},
				{'name':'莫兰缇高级翻糖课程','tit':false,'text':['1.花卉制作：玫瑰花、牡丹、蝴蝶兰、毛茛等；','2.翻糖卡通玩偶制作；','3.翻糖仿真人偶制作；','4.花卉组装：翻糖花成品的组装与搭配技巧','......'],'img':'procake-img250.jpg'},
				{'name':'莫兰缇韩式裱花课程','tit':true,'text':['1.花卉制作：玫瑰、芍药、芍药花苞、珍珠梅等；','2.叶子制作：多种叶子、小树枝等；','3.杯子蛋糕：海绵蛋糕制作与烘烤出品等；','4.整体造型设计：抹面练习、花卉摆放','......'],'img':'procake-img250.jpg'},
				{'name':'莫兰缇咖啡高级课程','tit':false,'text':['1.咖啡基础知识：吧台了解；关于咖啡豆等；','2.关于牛奶：牛奶的打发等；','3.关于拉花：如何掌握好拉花的技巧与练习奶泡与水流等；','4.咖啡的制作：卡布奇诺、焦糖玛奇朵、摩卡','......'],'img':'procake-img250.jpg'},
				{'name':'莫兰缇奶茶特饮课程','tit':true,'text':['1.冰沙类：芒果牛奶冰沙、奇异果冰沙、奥利奥旋风冰沙等；','2.鲜果乳酸菌：百香乳酸菌、香橙乳酸菌等；','3.经典奶茶：烤奶、黑水晶奶茶、奶茶三兄弟等；','4.气泡系列：百香益力多苏打、红石榴苏打','......'],'img':'procake-img250.jpg'},
				{'name':'莫兰缇港式甜品课程','tit':false,'text':['1.甜品类：椰汁西米露、杨枝甘露等；','2.手工甜品类：榴莲班戟、芒果千层、抹茶毛巾卷等；','3.养生甜品类：生磨芝麻糊、生磨花生糊等；','4.新品热销类：雪媚娘、冰皮月饼、千层椰香马蹄糕','......'],'img':'procake-img250.jpg'},
				{'name':'莫兰缇西餐班部分产品','tit':true,'text':['1.披萨基础知识：披萨讲解等；','2.披萨制作：披萨酱料的讲解汁、酱料的种类与制作过程等；','3.意大利面酱汁：演示制作意大利面酱汁等；','4.意大利面菜式：经典番茄意面、意大利肉经典酱面','......'],'img':'procake-img250.jpg'}
			],
	}
	var proShowTpl = template(document.getElementById('procakeshowtpl').innerHTML,prodata);
	document.getElementById('procakeshow').innerHTML = proShowTpl;
})();
	
